helloworld_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:oper="http://localhost/zoap/helloworld/server">
    <soapenv:Header/>
    <soapenv:Body>
        <oper:getHelloWorld></oper:getHelloWorld>
    </soapenv:Body>
</soapenv:Envelope>